RTEData/rte_data_samples/Consommation/speed_physical/getDonneesPhysiquesOperation.xml

<soapenv:Envelope xmlns="urn:iec62325.351:tc57wg16:451-4:energyaccountdocument:4:0" xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
  <soapenv:Header/>
  <soapenv:Body>
    <EnergyAccount_MarketDocument>
      <!--test ok sur 5 mn 4 PPE, avec que des valeurs brutes et changement d heure hiver ete 2h-->
      <mRID>10</mRID>
      <revisionNumber>1</revisionNumber>
      <type>A11</type>
      <docStatus>
        <value>A02</value>
      </docStatus>
      <process.processType>A05</process.processType>
      <process.classificationType>A01</process.classificationType>
      <sender_MarketParticipant.mRID codingScheme="A01">10XFR-RTE------Q</sender_MarketParticipant.mRID>
      <sender_MarketParticipant.marketRole.type>A09</sender_MarketParticipant.marketRole.type>
      <receiver_MarketParticipant.mRID codingScheme="A01">22X10092011----M</receiver_MarketParticipant.mRID>
      <receiver_MarketParticipant.marketRole.type>A05</receiver_MarketParticipant.marketRole.type>
      <createdDateTime>2015-03-29T00:14:00Z</createdDateTime>
      <!--changement d'heure hiver / ete 01h15 - 1h45  avant changement d heure-->
      <period.timeInterval>
        <start>2015-03-29T00:15Z</start>
        <end>2015-03-29T00:45Z</end>
      </period.timeInterval>
      <TimeSeries>
        <mRID>1</mRID>
        <businessType>A13</businessType>
        <product>8716867000016</product>
        <objectAggregation>A02</objectAggregation>
        <area_Domain.mRID codingScheme="A01">10YFR-RTE------C</area_Domain.mRID>
        <marketParticipant.mRID codingScheme="A01">22X10092011----M</marketParticipant.mRID>
        <marketAgreement.mRID/>
        <measure_Unit.name>KWT</measure_Unit.name>
        <currency_Unit.name>EUR</currency_Unit.name>
        <!--PPE 106661-->
        <marketEvaluationPoint.mRID codingScheme="A01">2573</marketEvaluationPoint.mRID>
        <Period>
          <timeInterval>
            <start>2015-03-29T00:15Z</start>
            <end>2015-03-29T00:45Z</end>
          </timeInterval>
          <resolution>PT1M</resolution>
          <Point>
            <position>1</position>
            <in_Quantity.quantity>460</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>3830</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>2</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>230</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>3</position>
            <in_Quantity.quantity>90</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>2580</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>4</position>
            <in_Quantity.quantity>400</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>2920</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>5</position>
            <in_Quantity.quantity>510</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>5190</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>6</position>
            <in_Quantity.quantity>60</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>4440</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>7</position>
            <in_Quantity.quantity>180</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>8530</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>8</position>
            <in_Quantity.quantity>390</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>8420</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>9</position>
            <in_Quantity.quantity>150</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>5950</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>10</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>6990</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>11</position>
            <in_Quantity.quantity>160</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>2200</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>12</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>8990</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>13</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>3220</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>14</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>4710</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>15</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>220</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>16</position>
            <in_Quantity.quantity>10</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>210</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>17</position>
            <in_Quantity.quantity>200</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>6470</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>18</position>
            <in_Quantity.quantity>40</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>9750</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>19</position>
            <in_Quantity.quantity>220</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>8470</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>20</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>7420</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>21</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>9120</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>22</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>3860</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>23</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>5240</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>24</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>9470</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>25</position>
            <in_Quantity.quantity>150</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>7390</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>26</position>
            <in_Quantity.quantity>70</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>8670</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>27</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>3790</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>28</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>650</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>29</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>5330</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
          <Point>
            <position>30</position>
            <in_Quantity.quantity>0</in_Quantity.quantity>
            <in_Quantity.quality>A04</in_Quantity.quality>
            <out_Quantity.quantity>14150</out_Quantity.quantity>
            <out_Quantity.quality>A04</out_Quantity.quality>
            <price.amount>1</price.amount>
          </Point>
        </Period>
      </TimeSeries>
    </EnergyAccount_MarketDocument>
  </soapenv:Body>
</soapenv:Envelope>